In [1]:
import pandas as pd
import numpy as np
import re
data = pd.read_csv('C:\\Users\\Askar\\Desktop\\programming\\coursera\\titanic.csv', index_col='PassengerId')

In [2]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.head(3)['Pclass']

PassengerId
1    3
2    1
3    3
Name: Pclass, dtype: int64

In [4]:
data['Pclass'].head(3)

PassengerId
1    3
2    1
3    3
Name: Pclass, dtype: int64

In [5]:
data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [7]:
data.isnull()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,True,False
4,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...
887,False,False,False,False,False,False,False,False,False,True,False
888,False,False,False,False,False,False,False,False,False,False,False
889,False,False,False,False,True,False,False,False,False,True,False
890,False,False,False,False,False,False,False,False,False,False,False
891,False,False,False,False,False,False,False,False,False,True,False

In [8]:
data.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [9]:
#Оставьте в выборке четыре признака: класс пассажира (Pclass), цену билета (Fare), возраст пассажира (Age) и его пол (Sex).
data = data.drop(['Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis=1)
data = data.dropna()

In [10]:
data['Sex'].value_counts()

male      453
female    261
Name: Sex, dtype: int64

In [11]:
#Обратите внимание, что признак Sex имеет строковые значения
#Перекодирование категориальных признаков
sex_mapping = {'male':0, 'female':1} #правило перекодировки
data['Sex'] = data['Sex'].map(sex_mapping) #функция map
data['Sex'].value_counts()

0    453
1    261
Name: Sex, dtype: int64

In [12]:
#Выделите целевую переменную — она записана в столбце Survived
#data = data.dropna()
X = data #Даннные X для обучения
X = X.drop(['Survived'], axis=1)
y = data['Survived'] #Целевой признак y

In [13]:
X.head(10)

             Pclass  Sex   Age     Fare
PassengerId
1                 3    0  22.0   7.2500
2                 1    1  38.0  71.2833
3                 3    1  26.0   7.9250
4                 1    1  35.0  53.1000
5                 3    0  35.0   8.0500
7                 1    0  54.0  51.8625
8                 3    0   2.0  21.0750
9                 3    1  27.0  11.1333
10                2    1  14.0  30.0708
11                3    1   4.0  16.7000

In [14]:
#from sklearn.model_selection import train_test_split
#X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=241)
#В параметрах конструктора можно сделать сплит выборки 1/3 к 2/3 с помощью test_size=0.33, но в задании этого не просят

In [15]:
#Проверим длину 
print(len(X), len(y))

714 714

In [16]:
#Обучите решающее дерево с параметром random_state=241 и остальными параметрами по умолчанию
#(речь идет о параметрах конструктора DecisionTreeСlassifier).
from sklearn.tree import DecisionTreeClassifier
model_tree = DecisionTreeClassifier(random_state=241)
model_tree.fit(X, y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=241, splitter='best')

In [17]:
importances = model_tree.feature_importances_
print(importances)

[0.14751816 0.30051221 0.25124241 0.30072722]